Repository: LovenSar/firmware-mod-kit-improveVer
Catalog: src/others/squashfs-3.3-grml-lzma/debian/doc/po/mksquashfs.*.po
Languages: fr

source: Create or modify a Squash file system
fr: Crée ou modifie un système de fichiers compressé <literal>Squash</literal>

source: A squashfs is a compressed read-only file system. Use the <command>&dhpackage;</command> program to create a new squashed file system, and to append new data to an existing squashed file system.
fr: Squashfs est un système de fichiers compressé, accessible en lecture seulement. Utilisez la commande <command>&dhpackage;</command> pour créer un nouveau système de fichiers de ce type ou pour ajouter des données à un système existant.

source: If a single source directory is specified (i.e. <userinput>mksquashfs <replaceable>source</replaceable> <replaceable>output_fs</replaceable></userinput>), the squashfs filesystem will consist of that directory, with the top-level root directory corresponding to the source directory.
fr: Si on ne donne qu'un seul répertoire source (i.e. <userinput>mksquashfs <replaceable>source</replaceable> <replaceable>sf_résultant</replaceable></userinput>), on obtiendra un système de fichiers constitué du contenu de ce répertoire source.

source: If multiple source directories or files are specified, <command>&dhpackage;</command> will merge the specified sources into a single filesystem, with the root directory containing each of the source files/directories. The name of each directory entry will be the basename of the source path. If more than one source entry maps to the same name, the conflicts are named <replaceable>xxx</replaceable>_1, <replaceable>xxx</replaceable>_2, etc. where <replaceable>xxx</replaceable> is the original name.
fr: Si on fournit plusieurs fichier(s) ou répertoire(s) sources, <command>&dhpackage;</command> créera un seul système de fichiers qui contiendra tous les répertoires et fichiers source. Le nom de chaque répertoire obtenu sera le nom <emphasis>sans chemin d'accès</emphasis> de chaque répertoire source ; En cas de noms identiques, les doublons seront renommés en <replaceable>xxx</replaceable>_1, <replaceable>xxx</replaceable>_2, etc.

source: The <replaceable>dest</replaceable> argument can either be a conventional file or a block device. If the file doesn't exist it will be created, if it does exist and a squashfs filesystem exists on it, <command>&dhpackage;</command> will append. The <option>-noappend </option>option will write a new filesystem irrespective of whether an existing filesystem is present.
fr: L'argument <replaceable>dest</replaceable> peut être soit un fichier classique, soit un périphérique de type bloc (comme un disque ou une partition). Si le fichier n'existe pas, il sera créé ; s'il existe déjà et contient un système de fichiers Squashfs, <command>&dhpackage;</command> rajoutera les sources données à son contenu actuel, sauf si l'option <option>-noappend</option> est précisée.

source: There are a large number of options that can be used to control the compression in <command>&dhpackage;</command>. By and large the defaults are the most optimum settings and should only be changed in exceptional circumstances !
fr: Il existe un grand nombre d'options qui permettent de contrôler la compression de <command>&dhpackage;</command>. Les valeurs par défaut sont de loin les optimales et ne devraient être modifiées qu'exceptionnellement !

source: The <option>-noI</option>, <option>-noD</option> and <option>-noF</option> options (also <option>-noInodeCompression</option>, <option>-noDataCompression</option> and <option>-noFragmentCompression</option>) can be used to force <command>&dhpackage;</command> to not compress inodes/directories, data and fragments respectively. Giving all options generates an uncompressed filesystem.
fr: Les options <option>-noI</option>, <option>-noD</option> et <option>-noF</option> (équivalentes à <option>-noInodeCompression</option>, <option>-noDataCompression</option> et <option>-noFragmentCompression</option>) peuvent être utilisées pour obliger <command>&dhpackage;</command> à ne pas comprimer respectivement les i-noeuds et répertoires, les blocs de données et les blocs de données fragmentés. Si l'on utilise ces trois options, on obtient un système de fichiers non comprimé.

source: By default files in the generated filesystem inherit the UID and GID ownership of the original file. However, <command>&dhpackage;</command> provides a number of options which can be used to override the ownership:
fr: Par défaut, les fichiers contenus dans le système de fichiers résultat ont le même propriétaire et groupe que les fichiers sources. Toutefois, <command>&dhpackage;</command> propose certaines options pour modifier ce comportement :

source: The options <option>-all-root</option> and <option>-root-owned</option> (both do exactly the same thing) force all file uids/gids in the generated Squashfs filesystem to be <literal>root</literal>. This allows root owned filesystems to be built without root access on the host machine.
fr: Les options <option>-all-root</option> et <option>-root-owned</option> (synonymes) forcent tous les fichiers du système de fichiers Squashfs généré à appartenir à <literal>root</literal> (utilisateur et groupe). Elle permet de construire un système de fichiers appartenant à <literal>root</literal> sans avoir un accès à ce compte sur la machine où on le construit.

source: The <option>-force-uid <replaceable>uid</replaceable></option> option forces all files in the generated Squashfs filesystem to be owned by the specified <replaceable>uid</replaceable>. The uid can be specified either by name (i.e. <literal>root</literal>) or by number.
fr: L'option <option>-force-uid <replaceable>uid</replaceable></option> force tous les fichiers du système de fichiers Squashfs généré à appartenir à l'utilisateur d'identifiant <replaceable>uid</replaceable> donné. Cet identifiant peut être soit un nom (par exemple <literal>root</literal>), soit un nombre.

source: The <option>-force-gid <replaceable>gid</replaceable></option> option forces all files in the generated Squashfs filesystem to be group owned by the specified <replaceable>gid</replaceable>. The gid can be specified either by name (i.e. <literal>root</literal>) or by number.
fr: L'option <option>-force-gid <replaceable>gid</replaceable></option> force tous les fichiers du système de fichiers Squashfs généré à appartenir au groupe d'identifiant <replaceable>gid</replaceable> donné. Cet identifiant peut être soit un nom (par exemple <literal>root</literal>), soit un nombre.

source: The <option>-e</option> and <option>-ef</option> options allow files/directories to be specified which are excluded from the output filesystem. The <option>-e</option> option takes the exclude files/directories from the command line, the <option>-ef</option> option takes the exlude files/directories from the specified exclude file, one file/directory per line. If an exclude file/directory is absolute (i.e. prefixed with <filename>/</filename>, <filename>../</filename>, or <filename>./</filename>) the entry is treated as absolute, however, if an exclude file/directory is relative, it is treated as being relative to each of the sources in turn, i.e. <userinput>mksquashfs /tmp/source1 source2 output_fs -e ex1 /tmp/source1/ex2 out/ex3</userinput> Will generate exclude files <filename>/tmp/source1/ex2</filename>, <filename>/tmp/source1/ex1</filename>, <filename>source2/ex1</filename>, <filename>/tmp/source1/out/ex3</filename> and <filename>source2/out/ex3</filename>.
fr: Les options <option>-e</option> et <option>-ef</option> permettent de déclarer des fichiers ou répertoires à exclure du système de fichiers résultat. L'option <option>-e</option> lit les fichiers/répertoires à exclure sur la ligne de commande, tandis que l'option <option>-ef</option> les trouve dans le fichier d'exclusions spécifié contenant un fichier ou répertoire par ligne. Si le chemin d'un fichier ou répertoire à exclure est absolu (c'est-à-dire débutant par <filename>/</filename>, <filename>../</filename> ou <filename>./</filename>), il est considéré indépendamment des sources ; en revanche, s'il est relatif, il s'appliquera pour chaque répertoire source ; par exemple, <userinput>mksquashfs /tmp/source1 source2 sf_résultant -e ex1 /tmp/source1/ex2 out/ex3</userinput> exclura les fichiers <filename>/tmp/source1/ex2</filename>, <filename>/tmp/source1/ex1</filename>, <filename>source2/ex1</filename>, <filename>/tmp/source1/out/ex3</filename> et <filename>source2/out/ex3</filename>.

source: The <option>-e</option> and <option>-ef</option> exclude options are usefully used in archiving the entire filesystem, where it is wished to avoid archiving <filename>/proc</filename>, and the filesystem being generated, i.e. <userinput>mksquashfs / /tmp/root.sqsh -e proc /tmp/root.sqsh</userinput>
fr: Ces options <option>-e</option> et <option>-ef</option> sont pratiques pour, par exemple, archiver un système de fichier complet en évitant le répertoire <filename>/proc</filename> et le système de fichiers résultat : <userinput>mksquashfs / /tmp/root.sqsh -e proc /tmp/root.sqsh</userinput>

source: Multiple <option>-ef</option> options can be specified on the command line, and the <option>-ef</option> option can be used in conjuction with the <option>-e</option> option.
fr: On peut utiliser plusieurs fois l'option <option>-ef</option> dans une même commande, et on peut également l'utiliser en même temps que l'option <option>-e</option>.

source: The <option>-info</option> option displays the files/directories as they are compressed and added to the filesystem. The original uncompressed size of each file is printed, along with <literal>DUPLICATE</literal> if the file is a duplicate of a file in the filesystem.
fr: L'option <option>-info</option> affiche les fichiers et répertoires ajoutés au système de fichiers, avec leur taille originelle et éventuellement le mot <literal>DUPLICATE</literal> si un fichier avec un contenu identique y est déjà présent.

source: The <option>-no-exports</option> option doesn't make the filesystem exportable via NFS.
fr: L'option <option>-no-exports</option> permet d'éviter le partage du système de fichiers par NFS

source: The <option>-no-progress</option> option doesn't display the progress bar.
fr: L'option <option>-no-progress</option> n'affiche pas la barre de progression

source: The <option>-le</option> and <option>-be</option> options can be used to force <command>&dhpackage;</command> to generate a little endian or big endian filesystem. Normally <command>&dhpackage;</command> will generate a filesystem in the host byte order. Squashfs, for portability, will mount different ordered filesystems (i.e. it can mount big endian filesystems running on a little endian machine), but these options can be used for greater optimisation.
fr: Les options <option>-le</option> et <option>-be</option> peuvent servir à forcer <command>&dhpackage;</command> à générer un système de fichiers <foreignphrase>little endian</foreignphrase> ou <foreignphrase>big endian</foreignphrase>. Par défaut, <command>&dhpackage;</command> génère un système de fichiers avec le boutisme de la machine hôte. Le pilote Squashfs permettant, par souci de portabilité, de monter les deux types de systèmes de fichiers (c'est-à-dire qu'il peut monter un système <foreignphrase>big endian</foreignphrase> sur une machine <foreignphrase>little endian</foreignphrase>), ces options peuvent servir à améliorer l'efficacité d'un système de fichiers généré pour une architecture différente.

source: print version, licence and copyright message.
fr: affiche la version, la licence et un message de copyright.

source: <option>-recover <replaceable>name</replaceable></option>
fr: <option>-recover <replaceable>nom</replaceable></option>

source: Allows the original filesystem to be recovered if Mksquashfs aborts unexpectedly (i.e. power failure) using recovery file <replaceable>name</replaceable>. Recovery files are now created when appending to existing Squashfs filesystems.
fr: Permet au système de fichier original d'être restauré si Mksquashfs se termine de façon inattendu (par exemple alimentation défaillante) en utilisant le fichier de restauration <replaceable>nom</replaceable>. Les fichiers de restauration sont désormais créés lors de l'ajout à un système de fichier Squashfs existant.

source: don't generate a recovery file
fr: ne pas générer un fichier de restauration

source: print files written to filesystem
fr: affiche les fichiers ajoutés au système de fichiers.

source: don't make the filesystem exportable via NFS
fr: permet d'éviter le partage du système de fichier par NFS

source: don't display the progress bar
fr: n'affiche pas la barre de progression

source: don't detect sparse files
fr: ne pas détecter les fichiers vides

source: <option>-b <replaceable>block_size</replaceable></option>
fr: <option>-b <replaceable>taille_bloc</replaceable></option>

source: set data block to <replaceable>block_size</replaceable>. Default is 131072 bytes
fr: fixe la taille des blocs de données à <replaceable>block_size</replaceable>. Par défaut, elle vaut 65536 octets.

source: <option>-processors <replaceable>number</replaceable></option>
fr: <option>-processors <replaceable>nombre</replaceable></option>

source: Use <replaceable>number</replaceable> processors. By default will use number of processors available
fr: Utilise <replaceable>nombre</replaceable> processeurs. Utilise par défaut le nombre de processeurs disponibles

source: <option>-read-queue <replaceable>size</replaceable></option>
fr: <option>-read-queue <replaceable>taille</replaceable></option>

source: Set input queue to <replaceable>size</replaceable> Mbytes. Default 64 Mbytes.
fr: Initialise la file d'entrée à <replaceable>taille</replaceable> Mo. La valeur par défaut est 64Mo.

source: <option>-write-queue <replaceable>size</replaceable></option>
fr: <option>-write-queue <replaceable>taille</replaceable></option>

source: Set output queue to <replaceable>size</replaceable> Mbytes. Default 512 Mbytes.
fr: Initialise la file de sortie à <replaceable>taille</replaceable> Mo. La valeur par défaut est 512Mo.

source: <option>-noI</option> or <option>-noInodeCompression</option>
fr: <option>-noI</option> ou <option>-noInodeCompression</option>

source: do not compress inode table
fr: ne comprime pas la table des i-noeuds.

source: <option>-noD</option>or <option>-noDataCompression</option>
fr: <option>-noD</option> ou <option>-noDataCompression</option>

source: do not compress data blocks
fr: ne comprime pas les blocs de données.

source: <option>-noF</option> or <option>-noFragmentCompression</option>
fr: <option>-noF</option> ou <option>-noFragmentCompression</option>

source: do not compress fragment blocks
fr: ne comprime pas les blocs fragmentés.

source: do not use fragments: tells <command>&dhpackage;</command> to not generate fragment blocks, and rather generate a filesystem similar to a Squashfs 1.x filesystem. It will of course still be a Squashfs 2.0 filesystem but without fragments, and so it won't be mountable on a Squashfs 1.x system.
fr: n'utilise pas de blocs fragmentés : indique à <command>&dhpackage;</command> de ne pas créer de blocs fragmentés, mais plutôt un système de fichiers du même genre que ceux des versions 1.x de Squashfs. Ce sera quand même un système de fichiers Squashfs 2.0 (mais sans fragments), donc il ne pourra être monté par un système Squashfs en version 1.x.

source: use fragment blocks for files larger than block size: tells <command>&dhpackage;</command> to always generate fragments for files irrespective of the file length. By default only small files less than the block size are packed into fragment blocks. The ends of files which do not fit fully into a block, are <emphasis>NOT</emphasis> by default packed into fragments. To illustrate this, a 100K file has an initial 64K block and a 36K remainder. This 36K remainder is not packed into a fragment by default. This is because to do so leads to a 10 - 20% drop in sequential I/O performance, as a disk head seek is needed to seek to the initial file data and another disk seek is need to seek to the fragment block. Specify this option if you want file remainders to be packed into fragment blocks. Doing so may increase the compression obtained <emphasis>BUT</emphasis> at the expense of I/O speed.
fr: utilise des blocs fragmentés pour les fichiers plus gros que la taille d'un bloc : indique à <command>&dhpackage;</command> d'utiliser des blocs fragmentés quelle que soit la longueur des fichiers. Par défaut, seuls les petits fichiers (dont la taille est inférieure à celle d'un bloc) sont assemblés dans des blocs fragmentés. La fin des fichiers qui remplisse plus d'un bloc ne sont <emphasis>pas</emphasis>, par défaut, assemblés dans des fragments. Par exemple, un fichier de 100 ko est découpé en un bloc de 64 ko et un reste de 36 ko, qui par défaut n'est pas placé dans un bloc fragmenté. Ce choix est fait pour éviter une perte de performance de 10 à 20% en accès séquentiel à ce genre de fichiers, car il faudrait sinon déplacer la tête de lecture d'un disque pour accéder au(x) bloc(s) entier(s) et un autre pour le fragment (qui ne sera sans doute pas consécutif). Utilisez cette option pour forcer ces fins de fichiers à être rassemblées dans les blocs fragmentés ; cela améliore le taux de compression obtenu <emphasis>mais</emphasis> au dépens de la vitesse d'accès.

source: do not perform duplicate checking: tells <command>&dhpackage;</command> to not check the files being added to the filesystem for duplicates. This can result in quicker filesystem generation and appending although obviously compression will suffer badly if there is a lot of duplicate files.
fr: ne vérifie pas s'il y a des doublons : indique à <command>&dhpackage;</command> de ne pas vérifier dans les fichiers ajoutés s'il y en a avec des contenus identiques. Ceci permet une génération/modification du système de fichiers résultant plus rapide, mais bien sûr le taux de compression sera nettement moins bon s'il y a beaucoup de fichiers aux contenus identiques.

source: do not append to existing filesystem
fr: ne pas ajouter en fin d'un système de fichiers existant.

source: if one source directory is specified, create a root directory containing that directory, rather than the contents of the directory
fr: si un répertoire source est donné, crée un système de fichiers contenant ce répertoire plutôt que simplement son contenu.

source: <option>-root-becomes <replaceable>name</replaceable></option>
fr: <option>-root-becomes <replaceable>nom</replaceable></option>

source: when appending source files/directories, make the original root become a subdirectory in the new root called <replaceable>name</replaceable>, rather than adding the new source items to the original root
fr: lorsqu'on ajoute des fichiers ou répertoires à un système existant, le contenu de l'ancien système sera placé dans un répertoire de <replaceable>nom</replaceable> donné, plutôt que de mélanger les anciens fichiers et les nouveaux.

source: <option>-all-root</option> or <option>-root-owned</option>
fr: <option>-all-root</option> ou <option>-root-owned</option>

source: make all files owned by root
fr: tous les fichiers ajoutés au système appartiendront à <literal>root</literal>.

source: set all file uids to <replaceable>uid</replaceable>
fr: tous les fichiers ajoutés au système appartiendront à l'utilisateur d'identifiant <replaceable>uid</replaceable> (un nom ou un nombre).

source: set all file gids to <replaceable>gid</replaceable>
fr: tous les fichiers ajoutés au système appartiendront au groupe d'identifiant <replaceable>gid</replaceable> (un nom ou un nombre).

source: create a little endian filesystem
fr: crée un système de fichiers au format petit boutiens (<foreignphrase>little endian</foreignphrase> en anglais).

source: create a big endian filesystem
fr: crée un système de fichiers au format gros boutiens (<foreignphrase>big endian</foreignphrase> en anglais).

source: do not pad filesystem to a multiple of 4Ko. This is performed by default to enable the output filesystem file to be mounted by loopback, which requires files to be a 4K multiple. If the filesystem is being written to a block device, or is to be stored in a bootimage, the extra pad bytes are not needed.
fr: Ne pas arrondir le système de fichiers au multiple de 4 ko [supérieur] : cet arrondi, effectué par défaut, permet au système de fichiers d'être monté par l'interface <literal>loopback</literal> qui ne fonctionne qu'avec des fichiers multiples de 4 ko. Si le système de fichiers est destiné à être écrit sur un périphérique de type bloc (un disque ou une partition par exemple) ou être placé dans une image de démarrage, cet arrondi est inutile.

source: add checkdata for greater filesystem checks
fr: positionne un drapeau dans le système de fichiers créé pour plus de vérifications de ce système lorsqu'il est monté.

source: <option>-sort <replaceable>sort_file</replaceable></option>
fr: <option>-sort <replaceable>ordre</replaceable></option>

source: sort files according to priorities in <replaceable>sort_file</replaceable>. One file or dir with priority per line. Priority -32768 to 32767, default priority 0
fr: trie les fichiers suivant les priorités décrites dans le fichier <replaceable>ordre</replaceable>, qui doit contenir un nom de fichier ou répertoire par ligne avec sa priorité associée (nombre entre -32768 et 32767, 0 par défaut).

source: <option>-e <replaceable>list of exclude dirs/files</replaceable></option>
fr: <option>-e <replaceable>liste des répertoires/fichiers exclus</replaceable></option>

source: inline list of files / directories to exclude
fr: liste (en ligne) des fichiers et répertoires à exclure.

source: <option>-ef <replaceable>exclude_file</replaceable></option>
fr: <option>-ef <replaceable>fichier_exclus</replaceable></option>

source: file containing a list of files / directories to exclude, one per line
fr: le fichier <replaceable>fichier_exclus</replaceable> contient la liste des fichiers ou répertoires à exclure, un par ligne.

source: Allow extended shell wildcards (globbing) to be used in exclude dirs/files
fr: Permet l'utilisation des caractères spéciaux de l'interpréteur de commande afin d'exclure des répertoires ou fichiers

source: Allow POSIX regular expressions to be used in exclude dirs/files
fr: Permet l'utilisation des expressions rationnelle POSIX pour l'exclusion de fichiers ou répertoires

source: EXAMPLES
fr: EXEMPLES

source: For following examples, take two example directories:
fr: Pour les exemples suivants, on utilise deux répertoires :

source: Source directory <filename>/home/phillip/test</filename> contains <filename>file1</filename>, <filename>file2</filename> and <filename>dir1</filename>.
fr: le répertoire source <filename>/home/phillip/test</filename> contient <filename>fichier1</filename>, <filename>fichier2</filename> et <filename>rep1</filename>.

source: Source directory <filename>goodies</filename> contains <filename>goodies1</filename>, <filename>goodies2</filename> and <filename>goodies3</filename>.
fr: le répertoire source <filename>outils</filename> contient <filename>outils1</filename>, <filename>outils2</filename> et <filename>outils3</filename>.

source: <userinput>mksquashfs /home/phillip/test output_fs</userinput>
fr: <userinput>mksquashfs /home/phillip/test sf_resultat</userinput>

source: This will generate a squashfs filesystem with root entries <filename>file1</filename>, <filename>file2</filename> and <filename>dir1</filename>.
fr: va créer un système de fichiers Squashfs contenant dans sa racine les items <filename>fichier1</filename>, <filename>fichier2</filename> et <filename>rep1</filename>.
