Repository: LovenSar/firmware-mod-kit-improveVer
Catalog: src/others/squashfs-3.3-grml-lzma/debian/doc/po/mksquashfs.*.po
Languages: fr

source: <userinput>mksquashfs /home/phillip/test goodies output_fs</userinput>
fr: <userinput>mksquashfs /home/phillip/test outils sf_resultat</userinput>

source: This will create a squashfs filesystem with the root containing entries <filename>test</filename> and <filename>goodies</filename> corresponding to the source directories <filename>/home/phillip/test</filename> and <filename>goodies</filename>.
fr: va créer un système de fichiers Squashfs contenant dans sa racine les répertoires <filename>test</filename> et <filename>outils</filename>, correspondant aux répertoires source <filename>/home/phillip/test</filename> et <filename>outils</filename>.

source: <userinput>mksquashfs /home/phillip/test goodies test output_fs</userinput>
fr: <userinput>mksquashfs /home/phillip/test outils test sf_resultat</userinput>

source: This is the same as the previous example, except a third source directory <filename>test</filename> has been specified. This conflicts with the first directory named <filename>test</filename> and will be renamed <filename>test_1</filename>.
fr: commande identique à l'exemple précédent, sauf qu'un troisième répertoire source <filename>test</filename> a été donné, d'où un conflit avec le premier répertoire <filename>test</filename>. Ce troisième répertoire sera donc renommé <filename>test_1</filename>.

source: Multiple sources allow filesystems to be generated without needing to copy all source files into a common directory. This simplifies creating filesystems.
fr: Donner plusieurs répertoires source permet de générer des systèmes de fichiers sans préalablement copier tous les fichiers nécessaires dans un répertoire commun, ce qui simplifie le processus.

source: <userinput>mksquashfs /home/phillip/test output_fs -keep-as-directory</userinput>
fr: <userinput>mksquashfs /home/phillip/test sf_resultat -keep-as-directory</userinput>

source: This is the same as the first example, except for <option>-keep-as-directory</option>. This will generate a root directory containing directory <filename>test</filename>, rather than the <filename>test</filename> directory contents <filename>file1</filename>, <filename>file2</filename> and <filename>dir1</filename>.
fr: commande identique au premier exemple, sauf que l'option <option>-keep-as-directory</option> va donner un système de fichiers dont la racine contiendra un répertoire <filename>test</filename>, au lieu de n'avoir que son contenu <filename>fichier1</filename>, <filename>fichier2</filename> et <filename>rep1</filename>.

source: AUTHORS
fr: AUTEURS

source: Squashfs was written by <personname> <firstname>Phillip</firstname> <surname>Lougher</surname> </personname> <email>plougher@users.sourceforge.net</email>, in Chepstow, Wales, UK. If you like the program, or have any problems, then please email me, as it's nice to get feedback !
fr: Squashfs a été écrit par <personname> <firstname>Phillip</firstname> <surname>Lougher</surname> </personname> <email>plougher@users.sourceforge.net</email>, à Chepstow, Pays de Galles, Royaume-Uni. Si vous appréciez ce programme ou rencontrez des problèmes en l'utilisant, contactez-le, il est intéressé par des retours d'expérience.

source: This manual page was written by &dhusername; &dhemail; for the &debian; system (but may be used by others) using the <citetitle>SquashFS HOWTO</citetitle> from <author> <firstname>Artemiy I.</firstname> <surname>Pavlov</surname> </author> and squashfs's <filename>README</filename> file. Permission is granted to copy, distribute and/or modify this document under the terms of the &gnu; General Public License, Version 2 any later version published by the Free Software Foundation.
fr: Cette page de manuel a été écrit par &dhusername; &dhemail; pour le système &debian; (mais peut être utilisé par d'autres) à partir du document <citetitle>SquashFS HOWTO</citetitle> de <author> <firstname>Artemiy I.</firstname> <surname>Pavlov</surname> </author> et du fichier <filename>README</filename> des sources de SquashFS. Il est permis de copier, distribuer et/ou modifier ce document en vertu de la licence GPL version 2 ou postérieure, telle que publiée par la Free Software Foundation.

source: On Debian systems, the complete text of the &gnu; General Public License can be found in <filename>/usr/share/common-licenses/GPL</filename>.
fr: Sur les systèmes Debian, le texte complet de la licence &gpl; (Licence Public Générale &gnu;) se trouve dans le fichier <filename>/usr/share/common-licenses/GPL</filename>.
